<?php

declare(strict_types=1);

return [
    'label' => 'Експортирай :label',

    'modal' => [
        'heading' => 'Експортирай :label',
        'form' => [
            'columns' => [
                'label' => 'Колони',
                'actions' => [
                    'select_all' => ['label' => 'Избери всички'],
                    'deselect_all' => ['label' => 'Отмени избора'],
                ],
                'form' => [
                    'is_enabled' => ['label' => ':column включена'],
                    'label' => ['label' => 'Етикет на :column'],
                ],
            ],
        ],
        'actions' => [
            'export' => ['label' => 'Експортирай'],
        ],
    ],

    'notifications' => [
        'completed' => [
            'title' => 'Експортът е завършен',
            'actions' => [
                'download_csv' => ['label' => 'Изтегли .csv'],
                'download_xlsx' => ['label' => 'Изтегли .xlsx'],
            ],
        ],
        'max_rows' => [
            'title' => 'Експортът е твърде голям',
            'body' => 'Не можете да експортирате повече от 1 ред наведнъж.|Не можете да експортирате повече от :count реда наведнъж.',
        ],
        'no_columns' => [
            'title' => 'Няма избрани колони',
            'body' => 'Моля, изберете поне една колона за експорт.',
        ],
        'started' => [
            'title' => 'Експортът е започнат',
            'body' => 'Експортът е започнат и 1 ред ще бъде обработен във фонов режим. Ще получите известие с линк за изтегляне, когато приключи.|Експортът е започнат и :count реда ще бъдат обработени във фонов режим. Ще получите известие с линк за изтегляне, когато приключи.',
        ],
    ],

    'file_name' => 'export-:export_id-:model',
];
