<?php

declare(strict_types=1);

return [
    'form' => [
        'name' => [
            'label' => 'Име',
        ],
        'email' => [
            'label' => 'Имейл',
        ],
        'profile_photo' => [
            'label' => 'Снимка',
        ],
        'current_password' => [
            'label' => 'Текуща парола',
        ],
        'new_password' => [
            'label' => 'Нова парола',
        ],
        'confirm_password' => [
            'label' => 'Потвърди паролата',
        ],
        'password' => [
            'label' => 'Парола',
        ],
        'locale' => [
            'label' => 'Език',
            'options' => [
                'en' => 'English',
                'bg' => 'Български',
            ],
        ],
    ],

    'sections' => [
        'update_profile_information' => [
            'title' => 'Профилна информация',
            'description' => 'Актуализирайте информацията и имейл адреса на акаунта си.',
        ],
        'update_password' => [
            'title' => 'Промяна на паролата',
            'description' => 'Уверете се, че акаунтът ви използва дълга, произволна парола за по-добра сигурност.',
        ],
        'browser_sessions' => [
            'title' => 'Браузър сесии',
            'description' => 'Управлявайте и излизайте от активните си сесии на други браузъри и устройства.',
            'notice' => 'При необходимост можете да излезете от всички останали браузър сесии на всичките си устройства. Някои от последните ви сесии са изброени по-долу, но този списък може да не е изчерпателен. Ако смятате, че акаунтът ви е компрометиран, трябва да актуализирате и паролата си.',
            'labels' => [
                'current_device' => 'Това устройство',
                'last_active' => 'Последно активно',
                'unknown_device' => 'Неизвестно',
            ],
        ],
        'delete_account' => [
            'title' => 'Изтриване на акаунт',
            'description' => 'Окончателно изтриване на акаунта.',
            'notice' => 'След като акаунтът ви бъде изтрит, всички ресурси и данни ще бъдат окончателно изтрити. Преди да изтриете акаунта си, моля, изтеглете всички данни или информация, която желаете да запазите.',
        ],
    ],

    'actions' => [
        'save' => 'Запази',
        'delete_account' => 'Изтрий акаунта',
        'log_out_other_browsers' => 'Изход от другите сесии',
    ],

    'notifications' => [
        'save' => [
            'success' => 'Запазено.',
        ],
        'logged_out_other_sessions' => [
            'success' => 'Всички останали браузър сесии бяха успешно прекратени.',
        ],
    ],

    'modals' => [
        'delete_account' => [
            'notice' => 'Сигурни ли сте, че искате да изтриете акаунта си? След като акаунтът ви бъде изтрит, всички ресурси и данни ще бъдат окончателно изтрити. Моля, въведете паролата си, за да потвърдите, че желаете окончателно да изтриете акаунта си.',
        ],
        'log_out_other_browsers' => [
            'title' => 'Изход от другите браузър сесии',
            'description' => 'Въведете паролата си, за да потвърдите, че желаете да излезете от другите си браузър сесии на всичките си устройства.',
        ],
    ],

    'edit_profile' => 'Редактиране на профил',
];
